Revit 2024 API
EnergyAnalysisSpace Class
 Analytical space.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class EnergyAnalysisSpace : Element
Visual Basic
Public Class EnergyAnalysisSpace _
	Inherits Element
Visual C++
public ref class EnergyAnalysisSpace : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace
See Also
EnergyAnalysisSpace Members
Autodesk.Revit.DB.Analysis Namespace